Tekla Open API Reference for Tekla Structures 2025
CylindricalSurface Properties
The CylindricalSurface type exposes the following members.
Properties
Name | Description
CenterLine
 Gets the center line of the bend surface (i.e. the line that crosses every circular cross section of the bend at their center point)
 (Inherited from BendSurface.)
EndFaceNormal1
 Gets the first end face normal.
 (Inherited from BendSurface.)
EndFaceNormal2
 Gets the second end face normal.
 (Inherited from BendSurface.)
IntersectionLine
 Gets intersection line.
 (Inherited from BendSurface.)
InwardCurved
 Gets the direction of the curve - true if the curve is oriented towards the intersection line, false otherwise.
 (Inherited from BendSurface.)
LateralBoundary1
 Gets or sets the first lateral boundary
 (Inherited from BendSurface.)
LateralBoundary2
 Gets or sets the second lateral boundary
 (Inherited from BendSurface.)
Radius
 Gets radius of the cylindrical surface.
RotationAxis
 Gets the unit vector that defines the rotation axis (for counter clockwise rotations) of the lateral boundaries of the surface. This axis is always parallel to the direction of the center line.
 (Inherited from BendSurface.)
SideBoundary1
 Gets or sets the first side boundary.
 (Inherited from BendSurface.)
SideBoundary2
 Gets or sets the second side boundary.
 (Inherited from BendSurface.)
Top
See Also
Reference
CylindricalSurface Class
Tekla.Structures.Model Namespace